In [1]:
import sqlite3
import pandas as pd

In [2]:
path_BD = 'D:/RFB07-20/CNPJ-full-master/data/CNPJ_full.db'
conBD = sqlite3.connect(path_BD)

In [3]:
sql = '''SELECT nome_socio, cnpj_cpf_socio
             FROM socios'''

In [4]:
df = pd.read_sql(sql, conBD)
df.head()

                    nome_socio cnpj_cpf_socio
0     MARCIO HAMILTON FERREIRA    ***923641**
1    NILSON MARTINIANO MOREIRA    ***491386**
2        WALTER MALIENI JUNIOR    ***718468**
3  CARLOS ALBERTO ARAUJO NETTO    ***415907**
4     ANTONIO MAURICIO MAURANO    ***022878**

In [ ]:
df.groupby(['nome_socio','cnpj_cpf_socio']).sum()